// Задача 19
// Напишите программу, которая принимает на вход пятизначное число 
// и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да



Console.WriteLine("Введите любое пятизначное число: ");
string num = Console.ReadLine();

int n = 5;

if (num.Length != n)
{
    Console.WriteLine("Не пятизначное число. Нарушено условие задачи");
}
else
{
    if (num[0] == num[4] || num[1] == num[3])
    {
        Console.WriteLine("Это число является палиндромом!");
    }
    else
    {
        Console.WriteLine("Число не является палиндромом");
    }
}






