//Задача 13: Напишите программу, которая выводит третью цифру 
// заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

int[] array = { 7, 8 };
int index = 0;
if (index < array.Length)
{
    Console.WriteLine("Tретьей цифры нет");
}
Console.WriteLine(array[2]);

