//Задача 13: Напишите программу, которая выводит третью цифру 
// заданного числа или сообщает, что третьей цифры нет.
// "-"  645 -> 5
// "-"  78 -> третьей цифры нет
// "+"  32679 -> 6


/* V 1. моя работа ( оценка 4)
// Комментарий от преподавателя "корректно выполняется только для пятизначных чисел, 
// попробуйте выполнить решение для чисел с любым количеством разрядов"


Console.WriteLine("Введите любое число больше 10, но меньше 100 000: ");
int num = Convert.ToInt32(Console.ReadLine());

if (99 <= num && num <= 999)
{
    Console.WriteLine("Третья цифра этого числа: " + num % 10);
}
if (num > 999)
{
    Console.WriteLine("Третья цифра этого числа: " + num / 100 % 10);
}
else
{
    Console.WriteLine("В данном числе отсутствует третья цифра. Введите другое число");
}
 */


// V 2. работа от преподавателя после проверки V 1. 
/* Юрий, здравствуйте. Конечно третья цифра числа это третья по-порядку, т.е. 
из примера "645 -> 5" - 5 это третья цифра в числе, то же и в примере "32679 -> 6". 
Решается задача достаточно просто, необходимо исходное число в цикле делить на 10 до тех пор, 
пока не останется три разряда, после чего взять остаток от деления на 10 (одно из решений). */

/* 
while (num > 999)
{
num = num / 10;
}
Console.WriteLine( num % 10); */

// таким образом программа будет корректно показывать третью цифру в числе с любым количеством разрядов */




// V 2. полная сборка задачи!

/* Console.WriteLine("Введите любое число: ");
int num = Convert.ToInt32(Console.ReadLine());

if (num < 99) Console.WriteLine("В данном числе отсутствует третья цифра. Введите другое число");
else
{
    while (num > 999)
    {
       num = num / 10; 
    }
    Console.WriteLine("Третья цифра этого числа: " + num % 10);
} */










