//Задача 13: Напишите программу, которая выводит третью цифру 
// заданного числа или сообщает, что третьей цифры нет.
// "-"  645 -> 5
// "-"  78 -> третьей цифры нет
// "+"  32679 -> 6

Console.WriteLine("Введите любое число больше 10, но меньше 100 000: ");
int num = Convert.ToInt32(Console.ReadLine());

if (99 <= num && num <= 999)
{
    Console.WriteLine("Третья цифра этого числа: " + num % 10);
}
if (num > 999)
{
    Console.WriteLine("Третья цифра этого числа: " + num / 100 % 10);
}
else
{
    Console.WriteLine("В данном числе отсутствует третья цифра. Введите другое число");
}
